## Load Data

In [1]:
# installing dependencies
%pip install matplotlib
%pip install pandas
%pip install numpy

Collecting matplotlib
  Using cached matplotlib-3.9.2-cp313-cp313-win_amd64.whl.metadata (11 kB)
Collecting contourpy>=1.0.1 (from matplotlib)
  Downloading contourpy-1.3.1-cp313-cp313-win_amd64.whl.metadata (5.4 kB)
Collecting cycler>=0.10 (from matplotlib)
  Using cached cycler-0.12.1-py3-none-any.whl.metadata (3.8 kB)
Collecting fonttools>=4.22.0 (from matplotlib)
  Using cached fonttools-4.54.1-cp313-cp313-win_amd64.whl.metadata (167 kB)
Collecting kiwisolver>=1.3.1 (from matplotlib)
  Using cached kiwisolver-1.4.7-cp313-cp313-win_amd64.whl.metadata (6.4 kB)
Collecting numpy>=1.23 (from matplotlib)
  Using cached numpy-2.1.3-cp313-cp313-win_amd64.whl.metadata (60 kB)
Requirement already satisfied: packaging>=20.0 in c:\dojo\vscode project\notebooks\labs\week_2_labs\.venv\lib\site-packages (from matplotlib) (24.2)
Collecting pillow>=8 (from matplotlib)
  Using cached pillow-11.0.0-cp313-cp313-win_amd64.whl.metadata (9.3 kB)
Collecting pyparsing>=2.3.1 (from matplotlib)
  Using cached pyparsing-3.2.0-py3-none-any.whl.metadata (5.0 kB)
Requirement already satisfied: python-dateutil>=2.7 in c:\dojo\vscode project\notebooks\labs\week_2_labs\.venv\lib\site-packages (from matplotlib) (2.9.0.post0)
Requirement already satisfied: six>=1.5 in c:\dojo\vscode project\notebooks\labs\week_2_labs\.venv\lib\site-packages (from python-dateutil>=2.7->matplotlib) (1.16.0)
Using cached matplotlib-3.9.2-cp313-cp313-win_amd64.whl (7.8 MB)
Downloading contourpy-1.3.1-cp313-cp313-win_amd64.whl (220 kB)
Using cached cycler-0.12.1-py3-none-any.whl (8.3 kB)
Using cached fonttools-4.54.1-cp313-cp313-win_amd64.whl (2.2 MB)
Using cached kiwisolver-1.4.7-cp313-cp313-win_amd64.whl (55 kB)
Using cached numpy-2.1.3-cp313-cp313-win_amd64.whl (12.6 MB)
Using cached pillow-11.0.0-cp313-cp313-win_amd64.whl (2.6 MB)
Using cached pyparsing-3.2.0-py3-none-any.whl (106 kB)
Installing collected packages: pyparsing, pillow, numpy, kiwisolver, fonttools, cycler, contourpy, matplotlib
Successfully installed contourpy-1.3.1 cycler-0.12.1 fonttools-4.54.1 kiwisolver-1.4.7 matplotlib-3.9.2 numpy-2.1.3 pillow-11.0.0 pyparsing-3.2.0
Note: you may need to restart the kernel to use updated packages.
Collecting pandas
  Using cached pandas-2.2.3-cp313-cp313-win_amd64.whl.metadata (19 kB)
Requirement already satisfied: numpy>=1.26.0 in c:\dojo\vscode project\notebooks\labs\week_2_labs\.venv\lib\site-packages (from pandas) (2.1.3)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\dojo\vscode project\notebooks\labs\week_2_labs\.venv\lib\site-packages (from pandas) (2.9.0.post0)
Collecting pytz>=2020.1 (from pandas)
  Using cached pytz-2024.2-py2.py3-none-any.whl.metadata (22 kB)
Collecting tzdata>=2022.7 (from pandas)
  Using cached tzdata-2024.2-py2.py3-none-any.whl.metadata (1.4 kB)
Requirement already satisfied: six>=1.5 in c:\dojo\vscode project\notebooks\labs\week_2_labs\.venv\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Using cached pandas-2.2.3-cp313-cp313-win_amd64.whl (11.5 MB)
Using cached pytz-2024.2-py2.py3-none-any.whl (508 kB)
Using cached tzdata-2024.2-py2.py3-none-any.whl (346 kB)
Installing collected packages: pytz, tzdata, pandas
Successfully installed pandas-2.2.3 pytz-2024.2 tzdata-2024.2
Note: you may need to restart the kernel to use updated packages.
Requirement already satisfied: numpy in c:\dojo\vscode project\notebooks\labs\week_2_labs\.venv\lib\site-packages (2.1.3)Note: you may need to restart the kernel to use updated packages.

### Importing dependencies and loading data from CSV

In [3]:
import pandas as pd

# loading sales data from a CSV file into DataFrame
customers_data = pd.read_csv('../ShopEase Data/customers.csv')
inventory_data = pd.read_csv('../ShopEase Data/inventory.csv')
order_item_data = pd.read_csv('../ShopEase Data/order_items.csv')
orders_data = pd.read_csv('../ShopEase Data/Orders.csv')
products_data = pd.read_csv('../ShopEase Data/products.csv')
suppliers_data = pd.read_csv('../ShopEase Data/suppliers_data.csv')

customers_data_df = pd.DataFrame(customers_data)
inventory_data_df = pd.DataFrame(inventory_data)
order_item_data_df = pd.DataFrame(order_item_data)
orders_data_df = pd.DataFrame(orders_data)
products_data_df = pd.DataFrame(products_data)
suppliers_data_df = pd.DataFrame(suppliers_data)

In [4]:
# printing the first 5 rows of each DataFrame

print("Customers Data:\n") 
display(customers_data_df.head()) #customers_data_df.head()
print("\nInventory Data:\n") 
display(inventory_data_df.head()) #inventory_data_df.head()
print("\nOrder Items Data:\n"),
display(order_item_data_df.head()) #order_item_data_df.head()
print("\nOrders Data:\n") 
display(orders_data_df.head()) #orders_data_df.head()
print("\nProducts Data:\n") 
display(products_data_df.head()) #products_data_df.head()
print("\nSuppliers Data:\n")
display(suppliers_data_df.head()) #suppliers_data_df.head()

Customers Data:

   customer_id  customer_name                email   join_date
0            1  Alice Johnson    alice@example.com  2023-01-15
1            2      Bob Smith      bob@example.com  2023-02-20
2            3  Charlie Davis  charlie@example.com  2023-03-05
3            4      David Lee    david@example.com  2023-03-10
4            5     Eve Parker      eve@example.com  2023-04-01

Inventory Data:

     product_name  stock_quantity  stock_date    supplier warehouse_location
0           Sugar             162   11/3/2024  Supplier D        Warehouse 3
1          Tablet             243  10/30/2024  Supplier C        Warehouse 2
2           Jeans             223  10/24/2024  Supplier B        Warehouse 3
3  Women's Jacket             187   8/31/2024  Supplier E        Warehouse 3
4         Blender             101   11/6/2024  Supplier E        Warehouse 1

Order Items Data:

   order_detail_id  order_id  quantity  product_id
0                1         1         3          34
1                2         1         2          47
2                3         2         4          10
3                4         2         3          77
4                5         3         2          76

Orders Data:

   order_id  Cutomer_id order_date  product_id  quantity
0         1          20  11/1/2024           3         2
1         2          36  11/1/2024           1         1
2         3           1  11/1/2024           8         3
3         4          36  11/2/2024           6         1
4         5          14  11/2/2024          12         2

Products Data:

   product_id    product_name     category   price
0           1          Laptop  Electronics  1200.0
1           2      Smartphone  Electronics   800.0
2           3          Tablet  Electronics   450.0
3           4  Wireless Mouse  Electronics    25.0
4           5        Keyboard  Electronics    50.0

Suppliers Data:

,supplier_name,supplier_address,email,contact_number,fax,account_number,order_history,contract,supplier_country,supplier_city,country_code
0,Supplier D,321 Pine St,supplierD@example.com,4567890123,3987654318,44445555,468,No,Germany,Berlin,49
1,Supplier D,321 Pine St,supplierD@example.com,4567890123,3987654318,44445555,61,No,Germany,Berlin,49
2,Supplier D,321 Pine St,supplierD@example.com,4567890123,3987654318,44445555,88,No,Germany,Berlin,49
3,Supplier A,123 Main St,supplierA@example.com,1234567890,987654321,11112222,353,Yes,USA,New York,1
4,Supplier D,321 Pine St,supplierD@example.com,4567890123,3987654318,44445555,547,No,Germany,Berlin,49

## Data Cleaning

In [39]:
# printing data types of each column in  each DataFrame
print('Customer DataFrame:')
print(customers_data_df.dtypes)

print('\nInventory DataFrame:')
print(inventory_data_df.dtypes)

print('\nOrder Items DataFrame:')
print(order_item_data_df.dtypes)

print('\nOrders DataFrame:')
print(orders_data_df.dtypes)

print('\nProducts DataFrame:')
print(products_data_df.dtypes)

print('\nSuppliers DataFrame:')
print(suppliers_data_df.dtypes)

Customer DataFrame:
customer_id       int64
customer_name    object
email            object
join_date        object
dtype: object

Inventory DataFrame:
product_name          object
stock_quantity         int64
stock_date            object
supplier              object
warehouse_location    object
dtype: object

Order Items DataFrame:
order_detail_id    int64
order_id           int64
quantity           int64
product_id         int64
dtype: object

Orders DataFrame:
order_id       int64
Cutomer_id     int64
order_date    object
product_id     int64
quantity       int64
dtype: object

Products DataFrame:
product_id        int64
product_name     object
category         object
price           float64
dtype: object

Suppliers DataFrame:
supplier_name       object
supplier_address    object
email               object
contact_number       int64
fax                  int64
account_number       int64
order_history        int64
contract            object
supplier_country    object
supplier_city       object
country_code         int64
dtype: object

In [40]:
# Handle missing values, remove duplicates, and convert data types in each column appropriately for each DataFrame


def clean_data(df_list):
    """A function to take in a list of DataFrames and clean it appropriately

    Args:
        df_list (list): List of DataFrames

    Returns:
        list: A list of cleaned DataFrames
    """
    
    cleaned_dfs =  []
    
    for df in df_list:
        df_copy = df.copy() # Making a copy of the DataFrame
        df_copy.dropna(inplace=True) # Drop rows with missing values
        df_copy.drop_duplicates(inplace=True) # Remove duplicate rows (records)
        
        for col in df_copy.select_dtypes(include=['object', 'datetime64[ns]', 'int64', 'float64']).columns:
            match df_copy[col].dtype:
                case 'object':
                    df_copy[col] = df_copy[col].str.strip() # Remove leading and trailing whitespace
                    
                    if 'date' in col.lower(): # If the column name contains 'date', convert to datetime
                        try: # Try to convert to datetime using a specific format. If it fails, convert to string
                            df_copy[col] = pd.to_datetime(df_copy[col], errors='coerce')
                        except ValueError:
                            pass # If conversion fails, keep the column as string
                    else:
                        df_copy[col] = df_copy[col].astype('string')
                        
                case 'datetime64[ns]':
                    df_copy[col] = pd.to_datetime(df_copy[col], errors='coerce')
                    
                case 'int64':
                    df_copy[col] = df_copy[col].astype('int64')
                    
                case 'float64':
                    df_copy[col] = df_copy[col].astype('float64')
                    
        cleaned_dfs.append(df_copy)
    return cleaned_dfs


cleaned_dfs = clean_data([customers_data_df, inventory_data_df, order_item_data_df, orders_data_df, products_data_df, suppliers_data_df])

# Display the first 5 rows of each cleaned DataFrame
for each_df in cleaned_dfs:
    (display(each_df.head()))

   customer_id  customer_name                email  join_date
0            1  Alice Johnson    alice@example.com 2023-01-15
1            2      Bob Smith      bob@example.com 2023-02-20
2            3  Charlie Davis  charlie@example.com 2023-03-05
3            4      David Lee    david@example.com 2023-03-10
4            5     Eve Parker      eve@example.com 2023-04-01

     product_name  stock_quantity stock_date    supplier warehouse_location
0           Sugar             162 2024-11-03  Supplier D        Warehouse 3
1          Tablet             243 2024-10-30  Supplier C        Warehouse 2
2           Jeans             223 2024-10-24  Supplier B        Warehouse 3
3  Women's Jacket             187 2024-08-31  Supplier E        Warehouse 3
4         Blender             101 2024-11-06  Supplier E        Warehouse 1

   order_detail_id  order_id  quantity  product_id
0                1         1         3          34
1                2         1         2          47
2                3         2         4          10
3                4         2         3          77
4                5         3         2          76

   order_id  Cutomer_id order_date  product_id  quantity
0         1          20 2024-11-01           3         2
1         2          36 2024-11-01           1         1
2         3           1 2024-11-01           8         3
3         4          36 2024-11-02           6         1
4         5          14 2024-11-02          12         2

   product_id    product_name     category   price
0           1          Laptop  Electronics  1200.0
1           2      Smartphone  Electronics   800.0
2           3          Tablet  Electronics   450.0
3           4  Wireless Mouse  Electronics    25.0
4           5        Keyboard  Electronics    50.0

,supplier_name,supplier_address,email,contact_number,fax,account_number,order_history,contract,supplier_country,supplier_city,country_code
0,Supplier D,321 Pine St,supplierD@example.com,4567890123,3987654318,44445555,468,No,Germany,Berlin,49
1,Supplier D,321 Pine St,supplierD@example.com,4567890123,3987654318,44445555,61,No,Germany,Berlin,49
2,Supplier D,321 Pine St,supplierD@example.com,4567890123,3987654318,44445555,88,No,Germany,Berlin,49
3,Supplier A,123 Main St,supplierA@example.com,1234567890,987654321,11112222,353,Yes,USA,New York,1
4,Supplier D,321 Pine St,supplierD@example.com,4567890123,3987654318,44445555,547,No,Germany,Berlin,49

In [41]:
# Unpacking the cleaned DataFrames into new variables starting with c_ standing for cleaned
c_customers_data_df, c_inventory_data_df, c_order_item_data_df, c_orders_data_df, c_products_data_df, c_suppliers_data_df = cleaned_dfs

# printing data types of each column in  each DataFrame
print('Customer DataFrame:')
print(c_customers_data_df.dtypes)

print('\nInventory DataFrame:')
print(c_inventory_data_df.dtypes)

print('\nOrder Items DataFrame:')    
print(c_order_item_data_df.dtypes)

print('\nOrders DataFrame:')
print(c_orders_data_df.dtypes)

print('\nProducts DataFrame:')
print(c_products_data_df.dtypes)

print('\nSuppliers DataFrame:')
print(c_suppliers_data_df.dtypes)

Customer DataFrame:
customer_id               int64
customer_name    string[python]
email            string[python]
join_date        datetime64[ns]
dtype: object

Inventory DataFrame:
product_name          string[python]
stock_quantity                 int64
stock_date            datetime64[ns]
supplier              string[python]
warehouse_location    string[python]
dtype: object

Order Items DataFrame:
order_detail_id    int64
order_id           int64
quantity           int64
product_id         int64
dtype: object

Orders DataFrame:
order_id               int64
Cutomer_id             int64
order_date    datetime64[ns]
product_id             int64
quantity               int64
dtype: object

Products DataFrame:
product_id               int64
product_name    string[python]
category        string[python]
price                  float64
dtype: object

Suppliers DataFrame:
supplier_name       string[python]
supplier_address    string[python]
email               string[python]
contact_number               int64
fax                          int64
account_number               int64
order_history                int64
contract            string[python]
supplier_country    string[python]
supplier_city       string[python]
country_code                 int64
dtype: object

## New Column with Total Revenue

In [ ]:
# Getting a summary of DataFrames needed for total_revenue calculation
c_order_item_data_df.info()
print('\n')
c_orders_data_df.info()
print('\n')
c_products_data_df.info()
print('\n')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1351 entries, 0 to 1350
Data columns (total 4 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   order_detail_id  1351 non-null   int64
 1   order_id         1351 non-null   int64
 2   quantity         1351 non-null   int64
 3   product_id       1351 non-null   int64
dtypes: int64(4)
memory usage: 42.3 KB


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 570 entries, 0 to 569
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   order_id    570 non-null    int64
 1   Cutomer_id  570 non-null    int64
 2   order_date  570 non-null    datetime64[ns]
 3   product_id  570 non-null    int64
 4   quantity    570 non-null    int64
dtypes: datetime64[ns](1), int64(4)
memory usage: 22.4 KB


<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    100 non-null    int64
 1   product_name  100 non-null    string
 2   category      100 non-null    string
 3   price         100 non-null    float64
dtypes: float64(1), int64(1), string(2)
memory usage: 3.3 KB

In [ ]:
import numpy as np

# Temporal merge of c_orders_data_df, c_order_item_data_df and c_products_data_df
# Merged temporally on product_id in order to easily calculate total_revenue based on the quantity and price
# suffixes added to avoid duplicate column names
order_merge_order_item_merge_product = pd.merge(c_orders_data_df,c_order_item_data_df, how='left', on='product_id', suffixes=('_order', '_order_item')).merge(c_products_data_df, how='left', on='product_id')

# order_merge_order_item_merge_product.head(10)


# Calculate the total revenue for each order
# order_merge_order_item_merge_product['total_revenue'] = order_merge_order_item_merge_product['price'] * order_merge_order_item_merge_product['quantity_order_item']

c_orders_data_df['total_revenue'] = np.multiply(order_merge_order_item_merge_product['quantity_order_item'], order_merge_order_item_merge_product['price'])

display(order_merge_order_item_merge_product.head())
# display(c_orders_data_df.head())

c_orders_data_df.head()

,order_id_order,Cutomer_id,order_date,product_id,quantity_order,total_revenue,order_detail_id,order_id_order_item,quantity_order_item,product_name,category,price
0,1,20,2024-11-01,3,2,900.0,30,15,2,Tablet,Electronics,450.0
1,1,20,2024-11-01,3,2,900.0,79,40,2,Tablet,Electronics,450.0
2,1,20,2024-11-01,3,2,1800.0,263,132,4,Tablet,Electronics,450.0
3,1,20,2024-11-01,3,2,1350.0,298,149,3,Tablet,Electronics,450.0
4,1,20,2024-11-01,3,2,1800.0,327,164,4,Tablet,Electronics,450.0

   order_id  Cutomer_id order_date  product_id  quantity  total_revenue
0         1          20 2024-11-01           3         2          900.0
1         2          36 2024-11-01           1         1          900.0
2         3           1 2024-11-01           8         3         1800.0
3         4          36 2024-11-02           6         1         1350.0
4         5          14 2024-11-02          12         2         1800.0

## Data Transformations (Extracting  year, month, day)

In [58]:
# Extract the year, month, and day using the dt accessor
c_orders_data_df['year'] = c_orders_data_df['order_date'].dt.year
c_orders_data_df['month'] = c_orders_data_df['order_date'].dt.month
c_orders_data_df['day'] = c_orders_data_df['order_date'].dt.day

# Create a new columns for each year, month, and day
c_orders_data_df['year'] = c_orders_data_df['order_date'].dt.year
c_orders_data_df['month'] = c_orders_data_df['order_date'].dt.month
c_orders_data_df['day'] = c_orders_data_df['order_date'].dt.day

display(c_orders_data_df.head(10))
display(c_orders_data_df.info())

,order_id,Cutomer_id,order_date,product_id,quantity,total_revenue,year,month,day
0,1,20,2024-11-01,3,2,900.0,2024,11,1
1,2,36,2024-11-01,1,1,900.0,2024,11,1
2,3,1,2024-11-01,8,3,1800.0,2024,11,1
3,4,36,2024-11-02,6,1,1350.0,2024,11,2
4,5,14,2024-11-02,12,2,1800.0,2024,11,2
5,6,8,2024-11-02,25,4,2250.0,2024,11,2
6,7,18,2024-11-03,19,1,1350.0,2024,11,3
7,8,47,2024-11-03,15,1,900.0,2024,11,3
8,9,22,2024-11-03,33,3,1350.0,2024,11,3
9,10,8,2024-11-04,7,2,1800.0,2024,11,4

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 570 entries, 0 to 569
Data columns (total 9 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   order_id       570 non-null    int64
 1   Cutomer_id     570 non-null    int64
 2   order_date     570 non-null    datetime64[ns]
 3   product_id     570 non-null    int64
 4   quantity       570 non-null    int64
 5   total_revenue  570 non-null    float64
 6   year           570 non-null    int32
 7   month          570 non-null    int32
 8   day            570 non-null    int32
dtypes: datetime64[ns](1), float64(1), int32(3), int64(4)
memory usage: 33.5 KB

None